# GetFamilyPointLocations Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySymbol..::..GetFamilyPointLocations Method
FamilySymbol Class See Also
---
Returns the Point Locations for the Family Symbol.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public IList<FamilyPointLocation> GetFamilyPointLocations()
```

Visual Basic
---
```text
Public Function GetFamilyPointLocations As IList(Of FamilyPointLocation)
```

Visual C++
---
```text
public:
IList<FamilyPointLocation^>^ GetFamilyPointLocations()
```

# Remarks
If a family symbol has point references then their locations are returned by this method, otherwise an empty collection is returned. Examples of FamilySymbol objects that contain point location are Panels and Flexible Components.
# See Also
FamilySymbol Class
Autodesk.Revit.DB Namespace